Revit 2027 API
IFCAnyHandle.UnsetAttribute Method
 Unsets the attribute value.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void UnsetAttribute(
	string name
)
Public Sub UnsetAttribute (
	name As String
)
public:
void UnsetAttribute(
	String^ name
)
member UnsetAttribute :
        name : string -> unit
Parameters
name String
 The attribute name.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace